In [22]:
import pandas as pd
import numpy as np

In [3]:
#Titanic datasetini okuyoruz ve ilk 5 satırını inceliyoruz.
titanic=pd.read_csv("Titanic_dataset.csv")
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [11]:
#Kazada ölenlerin yaş ortalaması
titanic_ölüm=titanic[titanic["Survived"]==0]
yas_ortalama_ölüm=titanic_olum["Age"].mean()
yas_ortalama_ölüm

30.62617924528302

In [13]:
#Kazada ölenlerin bilet fiyatlarının ortalama ve medyanı
bilet_ortalama_ölen=titanic_ölüm["Fare"].mean()
bilet_medyan_ölen=titanic_ölüm["Fare"].median()
bilet_ortalama_ölen,bilet_medyan_ölen

(22.117886885245902, 10.5)

In [14]:
#Kazada ölen erkeklerin yaş ortalaması
erkek_ölüm_yas_ortalama=titanic_ölüm[titanic_ölüm["Sex"]=="male"]["Age"].mean()
erkek_ölüm_yas_ortalama

31.618055555555557

In [15]:
#Kazada ölen kadınların yaş ortalaması
kadın_ölüm_yas_ortalama=titanic_ölüm[titanic_ölüm["Sex"]=="female"]["Age"].mean()
kadın_ölüm_yas_ortalama

25.046875

In [16]:
#Kazadan kurtulanların yaş ortalaması
titanic_yasayan=titanic[titanic["Survived"]==1]
yasayan_ortalama=titanic_yasayan["Age"].mean()
yasayan_ortalama

28.343689655172415

In [18]:
#Kazadan kurtulanların bilet fiyatlarının ortalaması
#titanic_yasayan=titanic[titanic["Survived"]==1]
bilet_ortalama_yasayan=titanic_yasayan["Fare"].mean()
bilet_ortalama_yasayan

48.39540760233918

In [20]:
#Kazadan kurtulan toplam kişi sayısı
toplam_yasayan_kisi=len(titanic_yasayan)
toplam_yasayan_kisi

342

In [21]:
#10 yaşından küçüklerin bilet fiyatlarının medyan değeri
on_yasından_kücükler=titanic[titanic["Age"]<10]["Fare"].median()
on_yasından_kücükler

27.0

In [23]:
#1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarının ortalama ve medyanları
sınıflar=titanic.groupby("Pclass")["Fare"].agg(["mean","median"])
sınıflar

             mean   median
Pclass
1       84.154687  60.2875
2       20.662183  14.2500
3       13.675550   8.0500

In [24]:
#Kazada ölen kadınların oranı ile erkeklerin oranı
toplam_erkek_sayısı=titanic[titanic["Sex"]=="male"].shape[0]
toplam_kadın_sayısı=titanic[titanic["Sex"]=="female"].shape[0]
ölen_erkek_sayısı=titanic_ölüm[titanic_ölüm["Sex"]=="male"].shape[0]
ölen_kadın_sayısı=titanic_ölüm[titanic_ölüm["Sex"]=="female"].shape[0]

kadın_ölüm_oranı=ölen_kadın_sayısı / toplam_kadın_sayısı
erkek_ölüm_oranı=ölen_erkek_sayısı / toplam_erkek_sayısı
kadın_ölüm_oranı,erkek_ölüm_oranı

(0.25796178343949044, 0.8110918544194108)